<?php
/*
 3. Сделайте счетчик обновления страницы пользователем.
Данные храните в сессии. Скрипт должен выводить на экран количество обновлений.
При первом заходе на страницу он должен вывести сообщение о том, что вы еще не обновляли страницу.
 */
session_start();

if(!isset($_SESSION['counter'])) { // якщо не було встановлено значення лічильника змінної
    $_SESSION['counter']=1; // присвоїти значення 1 як початкове (і тому що перший раз запускається)
    echo "Вітаннячко, Ви ще не обновляли сторінку, обнови."; // вивід на екран інфу
}else{
    $_SESSION['counter'] = $_SESSION['counter'] + 1; // інакше, якщо цю сторінку вже відкривати то прибавити до лічильника +1
    echo "Ви відвідали цю сторінку - " . $_SESSION['counter'] . " раз"; // вивід на екран значення лічильника
}
//session_destroy(); // потрібний щоб видалити всі змінні сесії
//unset($_SESSION['counter']); // видаля змінну сесії
